app/Payment.php

select * from `nikolag_transactions` where `payment_service_id` = 'bVYMVSTegHIaAjjCabvifuvbrSEZY' limit 1
---
    public function transactionDetail()
    {
        $transaction = DB::table('nikolag_transactions')->where('payment_service_id',$this->transaction_id)->first();