app/Http/Controllers/CartController.php

        error_log($square);
        $square->status == "PAID" ?  $payment_status =  OrderPaymentStatusEnum::SUCCESS   : $payment_status =  OrderPaymentStatusEnum::FAILED;
        $promotion = str_random(7);
        $order = $user->orders()->create([
            'transaction_id'    => $square->payment_service_id,
            'amount'            => \Cart::getTotal(),
            'job_qty'           => $cartItem->attributes->job_number,
            'package_type'      => $cartItem->attributes->type,
            'status'            => OrderStatusEnum::PROCCESS,
            'payment_status'    => $payment_status,
            'promotion_code'    => $promotion
        ]);
---
select * from `orders` where `user_id` = 1 and `package_type` = '0'