app/Http/Controllers/HomeController.php

    public function index(){
        $categories = Category::orderBy('category_name', 'asc')->get();
        $premium_jobs = Job::active()->premium()->orderBy('id', 'desc')->with('employer')->get();
        $regular_jobs = Job::active()->orderBy('id', 'desc')->with('employer')->take(15)->get();
        $jobsCount = Job::active()->count();
        $employersCount = User::where('user_type','employer')->count();
        $blog_posts = Post::whereType('post')->with('author')->orderBy('id', 'desc')->take(3)->get();
        $packages = Pricing::all();
---
select * from `categories` order by `category_name` asc
select count(*) as aggregate from `users` where `user_type` = 'employer'
select * from `posts` where `type` = 'post' order by `id` desc limit 3
select * from `pricings`

    public function advertise(){
        $user = auth()->user();

        if(!$user){
            return redirect()->route('login');
        }

        $title = __('app.advertise');
        $p_waitings = Package::where('type',PackageTypeEnums::ENTERPRISE)->get();
        $p_profational = Package::where('type',PackageTypeEnums::PROFESSIONAL)->get();
        $waitings = Package::all();
---
select * from `packages` where `type` = '0'
select * from `packages` where `type` = '1'
select * from `packages`