app/Http/Controllers/JobController.php

select * from `orders` where `id` = '10' limit 1
select * from `categories` order by `category_name` asc
select * from `countries`
---
    public function newJob($type,$order){
        $user = auth()->user();
        $order = Order::where('id',$order)->first();

        if(!$order || !$order->package_type == $type){
            return redirect()->route('employer_orders');
        }
        if(!$order->job_qty > $order->job_posted){
            return redirect()->route('employer_orders');
        }


        $title = __('app.post_new_job');
        $categories = Category::orderBy('category_name', 'asc')->get();
        $countries = Country::all();

select * from `orders` where `id` is null limit 1
update `orders` set `job_posted` = 1, `orders`.`updated_at` = '2021-01-14 09:50:45' where `id` = 18
---

        $job->update(['job_id' => $job->id.$job_id]);
        error_log($request->order);
        $order =  Order::where('id', $request->order)->first();
        $order ->update(['job_posted' => $order->job_posted + 1]);

select * from `categories` order by `category_name` asc
select * from `countries`
---
    public function edit($id){
        $title = __('app.edit_job');
        $job = Job::find($id);

        $user = Auth::user();
        if ( ! $user->is_admin() && $user->id != $job->user_id ){
            return redirect(route('dashboard'))->with('error', trans('app.access_restricted'));
        }

        $categories = Category::orderBy('category_name', 'asc')->get();
        $countries = Country::all();

select * from `job_applications` where `job_id` = '6' order by `id` desc limit 20 offset 0
select count(*) as aggregate from `job_applications` where `job_id` = '6'
---
    public function jobApplicants($job_id){
        $job = Job::find($job_id);

        $title = __('app.applicants')." For ({$job->job_title})";
        $applications = JobApplication::whereJobId($job_id)->orderBy('id', 'desc')->paginate(20);

select * from `categories` order by `category_name` asc
select * from `countries`
---
    public function jobsListing(Request $request){

        $title = "Browse Jobs";


        $categories = Category::orderBy('category_name', 'asc')->get();
        $countries = Country::all();