app/Http/Controllers/PaymentController.php

    public function index(Request $request){
        $user = Auth::user();
        $title = trans('app.payments');

        if ($user->is_admin()){
            if ($request->q){
                $payments = Payment::with('user')->where('email', 'like', "%{$request->q}%")->orderBy('id', 'desc')->paginate(20);
            }else{
                $payments = Payment::with('user')->orderBy('id', 'desc')->paginate(20);
---
select * from `payments` order by `id` desc limit 20 offset 0
select * from `users` where `users`.`id` in (1)
select count(*) as aggregate from `payments`