app/Http/Controllers/UserPackageController.php

select * from `userpackages` where `user_id` = 1
select `normal_job_number` from `userpackages` where `user_id` = 1 limit 1
select `special_job_number` from `userpackages` where `user_id` = 1 limit 1
update `userpackages` set `special_job_number` = 1, `userpackages`.`updated_at` = '2021-01-14 02:45:46' where `user_id` = 1
---
    public function add(Request $request){
        $user = auth()->user();
        if (UserPackage::where('user_id', $user->id)->get() == null) {
            $data = [
                'user_id' => $user->id,
            ];
            $newuserpackage = UserPackage::create($data);
        }
        $normal_num = UserPackage::where('user_id', $user->id)->value('normal_job_number');
        $special_num = UserPackage::where('user_id', $user->id)->value('special_job_number');
        if ($normal_num + $special_num == 0) {
            $data = [
                'user_id' => $user->id,
            ];
            $newuserpackage = UserPackage::create($data);
        }
        if ($request->type == '0') {
            $userpackage = UserPackage::where('user_id', $user->id)
                                    ->update(['normal_job_number' => $request->job_number + $normal_num]);
        }
        else{
            $userpackage = UserPackage::where('user_id', $user->id)
                                    ->update(['special_job_number' => $request->job_number + $special_num]);