app/Http/Controllers/UserController.php

select * from `orders` where `orders`.`user_id` = 1 and `orders`.`user_id` is not null
---
    public function employerOrders(Request $request)
    {
        $title = __('app.packages');
        $orders = auth()->user()->orders->sortByDesc('updated_at');

select * from `job_applications` where `user_id` = 4 order by `id` desc limit 20 offset 0
select count(*) as aggregate from `job_applications` where `user_id` = 4
---
    public function appliedJobs(){
        $title = __('app.applicants');
        $user_id = Auth::user()->id;
        $applications = JobApplication::whereUserId($user_id)->orderBy('id', 'desc')->paginate(20);

select * from `countries`
---
    public function registerEmployer(){

        if(auth()->user()){
            return redirect()->route('dashboard');
        };

        $title = __('app.employer_register');
        $countries = Country::all();

select * from `countries`
---
            'user_type'     => 'agent',
            'password'      => Hash::make($request->password),

            'phone'         => $request->phone,
            'address'       => $request->address,
            'address_2'     => $request->address_2,
            'country_id'    => $request->country,
            'country_name'  => $country->country_name,
            'state_id'      => $request->state,
            'state_name'    => $state_name,
            'city'          => $request->city,
            'active_status' => 1,
        ]);

select * from `countries`
---
    public function employerProfile(){
        $title = __('app.employer_profile');
        $user = Auth::user();


        $countries = Country::all();

select count(*) as aggregate from `job_applications` where `employer_id` = 1
---
    public function employerApplicant(){
        $title = __('app.applicant');
        $employer_id = Auth::user()->id;
        $applications = JobApplication::whereEmployerId($employer_id)->orderBy('id', 'desc')->paginate(20);

select count(*) as aggregate from `job_applications` where `employer_id` = 1 and `is_shortlisted` = 1
---
    public function shortlistedApplicant(){
        $title = __('app.shortlisted');
        $employer_id = Auth::user()->id;
        $applications = JobApplication::whereEmployerId($employer_id)->whereIsShortlisted(1)->orderBy('id', 'desc')->paginate(20);

select `experiences`.*, `experience_user`.`user_id` as `pivot_user_id`, `experience_user`.`experience_id` as `pivot_experience_id` from `experiences` inner join `experience_user` on `experiences`.`id` = `experience_user`.`experience_id` where `experience_user`.`user_id` = 4
select * from `info_users` where `info_users`.`user_id` = 4 and `info_users`.`user_id` is not null limit 1
---
    public function profileEdit($id = null){
        $title = trans('app.profile_edit');
        $user = Auth::user();
        $info = $user->userInfo;
        $experiences = Experience::all();
        $userExperiences = $user->experiences()->pluck('id')->toArray();
        if ($id){
            $user = User::find($id);